test/site/content-org/tags-and-categories.org
#+title: My Blog
#+author:

#+hugo_base_dir: ../

#+tags: these tags do not get globally applied to the posts

#+filetags: alpha beta
#+filetags: hyphened-tag
#+filetags: tag__with__lot__of__words

# Categories
#+filetags: @cat1

# All tags in above #+filetags lines will get collected.

# 1. Load `ox-hugo'
# 2. C-c C-e H A

** Inheriting tags                             :gamma:delta:two__words:@cat2:
:PROPERTIES:
:EXPORT_FILE_NAME: inheriting-tags
:END:
If user specifies tags to the post subtree heading, those tags get
added to the set of default tags set in =#+filetags= (and the ones
inherited). For the inheritance of tags from parent headings and
=#+filetags= to work, =org-use-tag-inheritance= needs to be set
appropriately if changed from the default value of =t=. These tags are
collected together and assigned to the Hugo =tags= front matter
variable for this post.

When setting categories via Org-style tags, prefix the tags with
"@". That "@" is used as a special character for =ox-hugo= to identify
those tags to be used as Hugo categories. This applies to categories
added as Org tags to headings as well as =#+filetags=.
